-- MySQL dump 10.13  Distrib 8.0.45, for Win64 (x86_64)
--
-- Host: localhost    Database: it_helpdesk
-- ------------------------------------------------------
-- Server version	8.0.45

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `notifications`
--

DROP TABLE IF EXISTS `notifications`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `notifications` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `ticket_id` int unsigned DEFAULT NULL,
  `user_id` int unsigned NOT NULL COMMENT 'ผู้รับการแจ้งเตือน',
  `type` varchar(100) NOT NULL COMMENT 'ประเภท เช่น TICKET_CREATED',
  `channel` enum('LINE','EMAIL','SYSTEM') NOT NULL DEFAULT 'LINE',
  `title` varchar(300) NOT NULL,
  `message` text NOT NULL,
  `is_sent` tinyint(1) NOT NULL DEFAULT '0',
  `sent_at` datetime DEFAULT NULL,
  `error_msg` text COMMENT 'ข้อผิดพลาด (ถ้ามี)',
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `idx_notif_user` (`user_id`),
  KEY `idx_notif_is_sent` (`is_sent`),
  KEY `idx_notif_ticket` (`ticket_id`),
  CONSTRAINT `fk_notif_ticket` FOREIGN KEY (`ticket_id`) REFERENCES `tickets` (`id`) ON DELETE CASCADE,
  CONSTRAINT `fk_notif_user` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=115 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='การแจ้งเตือน';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `notifications`
--

LOCK TABLES `notifications` WRITE;
/*!40000 ALTER TABLE `notifications` DISABLE KEYS */;
INSERT INTO `notifications` VALUES (50,62,60,'TICKET_CREATED','LINE','Ticket ใหม่: TK202600001','นางสาว อุษา อินมณี แจ้ง: เครื่องพิมพ์ขัดข้อง',1,'2026-05-22 15:57:46',NULL,'2026-05-22 15:57:46'),(51,62,60,'TICKET_CREATED','LINE','รับเรื่องแล้ว: TK202600001','ระบบรับเรื่องแจ้งซ่อม: เครื่องพิมพ์ขัดข้อง เรียบร้อยแล้ว',1,'2026-05-22 15:57:46',NULL,'2026-05-22 15:57:46'),(52,62,60,'TICKET_RESOLVED','LINE','งานเสร็จสิ้น: TK202600001','เครื่องพิมพ์ขัดข้อง ดำเนินการเสร็จสิ้นแล้ว',1,'2026-05-22 16:07:51',NULL,'2026-05-22 16:07:51'),(53,63,62,'TICKET_CREATED','LINE','รับเรื่องแล้ว: TK202600011','ระบบรับเรื่องแจ้งซ่อม: เครื่องพิมพ์ขัดข้อง เรียบร้อยแล้ว',1,'2026-05-26 08:43:22',NULL,'2026-05-26 08:43:22'),(54,63,62,'TICKET_CREATED','LINE','Ticket ใหม่: TK202600011','นางสาว สุพิชฌาย์ อิ่มวงศ์ แจ้ง: เครื่องพิมพ์ขัดข้อง',1,'2026-05-26 08:43:22',NULL,'2026-05-26 08:43:22'),(55,63,62,'TICKET_RESOLVED','LINE','งานเสร็จสิ้น: TK202600011','เครื่องพิมพ์ขัดข้อง ดำเนินการเสร็จสิ้นแล้ว',1,'2026-05-26 09:00:38',NULL,'2026-05-26 09:00:38'),(56,64,63,'TICKET_CREATED','LINE','รับเรื่องแล้ว: TK202600111','ระบบรับเรื่องแจ้งซ่อม: เครื่องพิมพ์ขัดข้อง เรียบร้อยแล้ว',1,'2026-05-26 09:25:43',NULL,'2026-05-26 09:25:43'),(57,64,63,'TICKET_CREATED','LINE','Ticket ใหม่: TK202600111','นางสาว วรชกร รัตนโชคธรณี แจ้ง: เครื่องพิมพ์ขัดข้อง',1,'2026-05-26 09:25:43',NULL,'2026-05-26 09:25:43'),(58,64,63,'TICKET_RESOLVED','LINE','งานเสร็จสิ้น: TK202600111','เครื่องพิมพ์ขัดข้อง ดำเนินการเสร็จสิ้นแล้ว',1,'2026-05-26 09:47:32',NULL,'2026-05-26 09:47:32'),(59,65,64,'TICKET_CREATED','LINE','รับเรื่องแล้ว: TK202601111','ระบบรับเรื่องแจ้งซ่อม: เครื่องพิมพ์ขัดข้อง เรียบร้อยแล้ว',1,'2026-05-26 10:11:42',NULL,'2026-05-26 10:11:42'),(60,65,64,'TICKET_CREATED','LINE','Ticket ใหม่: TK202601111','นางสาว วาสุนี ศรีนวล แจ้ง: เครื่องพิมพ์ขัดข้อง',1,'2026-05-26 10:11:42',NULL,'2026-05-26 10:11:42'),(61,65,64,'TICKET_RESOLVED','LINE','งานเสร็จสิ้น: TK202601111','เครื่องพิมพ์ขัดข้อง ดำเนินการเสร็จสิ้นแล้ว',1,'2026-05-26 10:17:41',NULL,'2026-05-26 10:17:41'),(62,66,65,'TICKET_CREATED','LINE','รับเรื่องแล้ว: TK202611111','ระบบรับเรื่องแจ้งซ่อม: เครื่องพิมพ์ขัดข้อง เรียบร้อยแล้ว',1,'2026-05-27 10:17:10',NULL,'2026-05-27 10:17:10'),(63,66,65,'TICKET_CREATED','LINE','Ticket ใหม่: TK202611111','ร.อ. นิชาธาร กาทอง แจ้ง: เครื่องพิมพ์ขัดข้อง',1,'2026-05-27 10:17:10',NULL,'2026-05-27 10:17:10'),(64,66,65,'TICKET_RESOLVED','LINE','งานเสร็จสิ้น: TK202611111','เครื่องพิมพ์ขัดข้อง ดำเนินการเสร็จสิ้นแล้ว',1,'2026-05-27 10:21:10',NULL,'2026-05-27 10:21:10'),(65,67,66,'TICKET_CREATED','LINE','รับเรื่องแล้ว: TK2026111111','ระบบรับเรื่องแจ้งซ่อม: โปรแกรม HOSxP ขัดข้อง เรียบร้อยแล้ว',1,'2026-05-27 11:08:58',NULL,'2026-05-27 11:08:58'),(66,67,66,'TICKET_CREATED','LINE','Ticket ใหม่: TK2026111111','นางสาว นวลจุฑา ปานพรม แจ้ง: โปรแกรม HOSxP ขัดข้อง',1,'2026-05-27 11:08:58',NULL,'2026-05-27 11:08:58'),(67,67,66,'TICKET_RESOLVED','LINE','งานเสร็จสิ้น: TK2026111111','โปรแกรม HOSxP ขัดข้อง ดำเนินการเสร็จสิ้นแล้ว',1,'2026-05-27 11:11:43',NULL,'2026-05-27 11:11:43'),(82,88,68,'TICKET_CREATED','LINE','Ticket ใหม่: TK202600007','นาง พัชรินทร์ พรมโคตร แจ้ง: การเผยแพร่ข่าวสาร / Social Media',1,'2026-05-27 14:11:10',NULL,'2026-05-27 14:11:10'),(83,88,68,'TICKET_CREATED','LINE','รับเรื่องแล้ว: TK202600007','ระบบรับเรื่องแจ้งซ่อม: การเผยแพร่ข่าวสาร / Social Media เรียบร้อยแล้ว',1,'2026-05-27 14:11:10',NULL,'2026-05-27 14:11:10'),(84,88,68,'TICKET_RESOLVED','LINE','งานเสร็จสิ้น: TK202600007','การเผยแพร่ข่าวสาร / Social Media ดำเนินการเสร็จสิ้นแล้ว',1,'2026-05-27 14:17:19',NULL,'2026-05-27 14:17:19'),(85,89,67,'TICKET_CREATED','LINE','Ticket ใหม่: TK202600008','นางสาว สุธิชา เพ่งไพฑูรย์ แจ้ง: เครื่องพิมพ์ขัดข้อง',1,'2026-05-27 14:22:24',NULL,'2026-05-27 14:22:24'),(86,89,67,'TICKET_CREATED','LINE','รับเรื่องแล้ว: TK202600008','ระบบรับเรื่องแจ้งซ่อม: เครื่องพิมพ์ขัดข้อง เรียบร้อยแล้ว',1,'2026-05-27 14:22:24',NULL,'2026-05-27 14:22:24'),(87,89,67,'TICKET_RESOLVED','LINE','งานเสร็จสิ้น: TK202600008','เครื่องพิมพ์ขัดข้อง ดำเนินการเสร็จสิ้นแล้ว',1,'2026-05-27 14:23:54',NULL,'2026-05-27 14:23:54'),(88,90,60,'TICKET_CREATED','LINE','รับเรื่องแล้ว: TK202600009','ระบบรับเรื่องแจ้งซ่อม: โปรแกรม HOSxP / โปรแกรมอื่น ๆ ขัดข้อง เรียบร้อยแล้ว',1,'2026-05-28 14:28:53',NULL,'2026-05-28 14:28:53'),(89,90,60,'TICKET_CREATED','LINE','Ticket ใหม่: TK202600009','นางสาว อุษา อินมณี แจ้ง: โปรแกรม HOSxP / โปรแกรมอื่น ๆ ขัดข้อง',1,'2026-05-28 14:28:53',NULL,'2026-05-28 14:28:53'),(90,91,69,'TICKET_CREATED','LINE','รับเรื่องแล้ว: TK202600010','ระบบรับเรื่องแจ้งซ่อม: โปรแกรม HOSxP / โปรแกรมอื่น ๆ ขัดข้อง เรียบร้อยแล้ว',1,'2026-05-28 14:40:48',NULL,'2026-05-28 14:40:48'),(91,91,69,'TICKET_CREATED','LINE','Ticket ใหม่: TK202600010','นางสาว สุกัญญา จามร แจ้ง: โปรแกรม HOSxP / โปรแกรมอื่น ๆ ขัดข้อง',1,'2026-05-28 14:40:48',NULL,'2026-05-28 14:40:48'),(92,90,60,'TICKET_RESOLVED','LINE','งานเสร็จสิ้น: TK202600009','โปรแกรม HOSxP / โปรแกรมอื่น ๆ ขัดข้อง ดำเนินการเสร็จสิ้นแล้ว',1,'2026-05-28 14:54:40',NULL,'2026-05-28 14:54:40'),(93,91,69,'TICKET_RESOLVED','LINE','งานเสร็จสิ้น: TK202600010','โปรแกรม HOSxP / โปรแกรมอื่น ๆ ขัดข้อง ดำเนินการเสร็จสิ้นแล้ว',1,'2026-05-28 14:57:34',NULL,'2026-05-28 14:57:34'),(94,92,70,'TICKET_CREATED','LINE','รับเรื่องแล้ว: TK202600011','ระบบรับเรื่องแจ้งซ่อม: โปรแกรม HOSxP / โปรแกรมอื่น ๆ ขัดข้อง เรียบร้อยแล้ว',1,'2026-05-29 10:00:37',NULL,'2026-05-29 10:00:37'),(95,92,70,'TICKET_CREATED','LINE','Ticket ใหม่: TK202600011','นางสาว ณัฐนันท์ โตแก้ว แจ้ง: โปรแกรม HOSxP / โปรแกรมอื่น ๆ ขัดข้อง',1,'2026-05-29 10:00:37',NULL,'2026-05-29 10:00:37'),(96,92,70,'TICKET_RESOLVED','LINE','งานเสร็จสิ้น: TK202600011','โปรแกรม HOSxP / โปรแกรมอื่น ๆ ขัดข้อง ดำเนินการเสร็จสิ้นแล้ว',1,'2026-05-29 10:20:27',NULL,'2026-05-29 10:20:27'),(97,93,71,'TICKET_CREATED','LINE','รับเรื่องแล้ว: TK202600012','ระบบรับเรื่องแจ้งซ่อม: โปรแกรม HOSxP / โปรแกรมอื่น ๆ ขัดข้อง เรียบร้อยแล้ว',1,'2026-06-02 13:07:33',NULL,'2026-06-02 13:07:33'),(98,93,71,'TICKET_CREATED','LINE','Ticket ใหม่: TK202600012','จ.ส.อ.หญิง ลภัสรดา พิมพ์สอาด แจ้ง: โปรแกรม HOSxP / โปรแกรมอื่น ๆ ขัดข้อง',1,'2026-06-02 13:07:33',NULL,'2026-06-02 13:07:33'),(99,94,72,'TICKET_CREATED','LINE','Ticket ใหม่: TK202600013','นางสาว รุ่งระวี ทิมทอง แจ้ง: เครื่องพิมพ์ขัดข้อง',1,'2026-06-02 14:22:12',NULL,'2026-06-02 14:22:12'),(100,94,72,'TICKET_CREATED','LINE','รับเรื่องแล้ว: TK202600013','ระบบรับเรื่องแจ้งซ่อม: เครื่องพิมพ์ขัดข้อง เรียบร้อยแล้ว',1,'2026-06-02 14:22:12',NULL,'2026-06-02 14:22:12'),(101,94,72,'TICKET_RESOLVED','LINE','งานเสร็จสิ้น: TK202600013','เครื่องพิมพ์ขัดข้อง ดำเนินการเสร็จสิ้นแล้ว',1,'2026-06-02 14:26:56',NULL,'2026-06-02 14:26:56'),(102,93,71,'TICKET_RESOLVED','LINE','งานเสร็จสิ้น: TK202600012','โปรแกรม HOSxP / โปรแกรมอื่น ๆ ขัดข้อง ดำเนินการเสร็จสิ้นแล้ว',1,'2026-06-02 14:29:10',NULL,'2026-06-02 14:29:10'),(103,95,73,'TICKET_CREATED','LINE','Ticket ใหม่: TK202600014','นางสาว ทิพยสุดา อินทวารี แจ้ง: ระบบอินเทอร์เน็ตขัดข้อง',1,'2026-06-02 14:39:36',NULL,'2026-06-02 14:39:36'),(104,95,73,'TICKET_CREATED','LINE','รับเรื่องแล้ว: TK202600014','ระบบรับเรื่องแจ้งซ่อม: ระบบอินเทอร์เน็ตขัดข้อง เรียบร้อยแล้ว',1,'2026-06-02 14:39:36',NULL,'2026-06-02 14:39:36'),(105,95,73,'TICKET_RESOLVED','LINE','งานเสร็จสิ้น: TK202600014','ระบบอินเทอร์เน็ตขัดข้อง ดำเนินการเสร็จสิ้นแล้ว',1,'2026-06-02 14:46:22',NULL,'2026-06-02 14:46:22'),(106,96,74,'TICKET_CREATED','LINE','รับเรื่องแล้ว: TK202600015','ระบบรับเรื่องแจ้งซ่อม: เครื่องคอมพิวเตอร์ขัดข้อง เรียบร้อยแล้ว',1,'2026-06-02 15:45:26',NULL,'2026-06-02 15:45:26'),(107,96,74,'TICKET_CREATED','LINE','Ticket ใหม่: TK202600015','นางสาว สุวรรณา เขื่อนแก้ว แจ้ง: เครื่องคอมพิวเตอร์ขัดข้อง',1,'2026-06-02 15:45:26',NULL,'2026-06-02 15:45:26'),(108,96,74,'TICKET_RESOLVED','LINE','งานเสร็จสิ้น: TK202600015','เครื่องคอมพิวเตอร์ขัดข้อง ดำเนินการเสร็จสิ้นแล้ว',1,'2026-06-02 15:46:53',NULL,'2026-06-02 15:46:53'),(109,97,71,'TICKET_CREATED','LINE','รับเรื่องแล้ว: TK202600016','ระบบรับเรื่องแจ้งซ่อม: โปรแกรม HOSxP / โปรแกรมอื่น ๆ ขัดข้อง เรียบร้อยแล้ว',1,'2026-06-04 08:17:21',NULL,'2026-06-04 08:17:21'),(110,97,71,'TICKET_CREATED','LINE','Ticket ใหม่: TK202600016','จ.ส.อ.หญิง ลภัสรดา พิมพ์สอาด แจ้ง: โปรแกรม HOSxP / โปรแกรมอื่น ๆ ขัดข้อง',1,'2026-06-04 08:17:22',NULL,'2026-06-04 08:17:22'),(111,97,71,'TICKET_RESOLVED','LINE','งานเสร็จสิ้น: TK202600016','โปรแกรม HOSxP / โปรแกรมอื่น ๆ ขัดข้อง ดำเนินการเสร็จสิ้นแล้ว',1,'2026-06-04 09:16:49',NULL,'2026-06-04 09:16:49'),(112,98,75,'TICKET_CREATED','LINE','รับเรื่องแล้ว: TK202600017','ระบบรับเรื่องแจ้งซ่อม: เครื่องคอมพิวเตอร์ขัดข้อง เรียบร้อยแล้ว',1,'2026-06-04 09:48:17',NULL,'2026-06-04 09:48:17'),(113,98,75,'TICKET_CREATED','LINE','Ticket ใหม่: TK202600017','นางสาว ปานตะวัน มีล้อม แจ้ง: เครื่องคอมพิวเตอร์ขัดข้อง',1,'2026-06-04 09:48:17',NULL,'2026-06-04 09:48:17'),(114,98,75,'TICKET_RESOLVED','LINE','งานเสร็จสิ้น: TK202600017','เครื่องคอมพิวเตอร์ขัดข้อง ดำเนินการเสร็จสิ้นแล้ว',1,'2026-06-04 09:49:43',NULL,'2026-06-04 09:49:43');
/*!40000 ALTER TABLE `notifications` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-06-04 12:53:01
